tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mscharley/homebrew"

brew "awscli"
brew "deno"
brew "direnv"
brew "gauche"
brew "gawk"
brew "ghq"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphviz"
brew "imagemagick@6"
brew "jenv"
brew "jq"
brew "libxslt"
brew "mecab"
brew "mysql@5.7"
brew "neovim"
brew "nginx"
brew "nkf"
brew "nvm"
brew "peco"
brew "pinentry-mac"
brew "pyenv"
brew "r"
brew "rbenv"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "tree"
brew "watchman"
brew "yarn"
brew "zplug"

cask "alfred"
cask "docker"
cask "google-cloud-sdk"
cask "karabiner-elements"
cask "ngrok"
cask "notion"
