
# tap repositories and their packages
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'heroku/brew'
tap 'mscharley/homebrew'
tap 'rcmdnk/file'

brew 'adns'
brew 'asciidoc'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bdw-gc'
brew 'boost'
brew 'brew-file'
brew 'c-ares'
brew 'cairo'
brew 'cmake'
brew 'czmq'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'gauche'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'ghostscript'
brew 'ghq'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gradle'
brew 'graphite2'
brew 'graphviz'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'haskell-stack'
brew 'icu4c'
brew 'imagemagick@6'
brew 'isl'
brew 'jansson'
brew 'jasper'
brew 'jemalloc'
brew 'jenv'
brew 'jpeg'
brew 'jq'
brew 'libassuan'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libmagic'
brew 'libmpc'
brew 'libpng'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxrender'
brew 'libxslt'
brew 'little-cms2'
brew 'luajit'
brew 'lzo'
brew 'mas'
brew 'mbedtls'
brew 'mecab'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'mysql@5.7'
brew 'ncurses'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nginx'
brew 'nkf'
brew 'node'
brew 'nodebrew'
brew 'npth'
brew 'nvm'
brew 'oniguruma'
brew 'openblas'
brew 'openjdk'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'p11-kit'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'peco'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pixman'
brew 'pkg-config'
brew 'pyenv'
brew 'python@3.8'
brew 'python@3.9'
brew 'r'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'ruby-build'
brew 'rust'
brew 'source-highlight'
brew 'sqlite'
brew 'tcl-tk'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'v8@3.15'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'xmlto'
brew 'xorgproto'
brew 'xz'
brew 'yarn'
brew 'zeromq', args: ['HEAD']
brew 'zplug'


tap 'homebrew/cask'
cask 'alacritty'
cask 'alfred'
cask 'docker'
cask 'google-cloud-sdk'
cask 'julia'
cask 'kap'
cask 'karabiner-elements'
cask 'ngrok'
cask 'notion'
cask 'skitch'

