aaron-bond.better-comments
asurance.binary-preview
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer-2
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
ishiyama.vue-autoimport
janisdd.vscode-edit-csv
jpoissonnier.vscode-styled-components
k--kato.intellij-idea-keybindings
mauve.terraform
mechatroner.rainbow-csv
mike-co.import-sorter
mikestead.dotenv
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-python.python
ms-vsliveshare.vsliveshare
naumovs.color-highlight
NuclleaR.vscode-extension-auto-import
octref.vetur
patricklee.vsnotes
rebornix.ruby
robinbentley.sass-indented
satokaz.vscode-bs-ctrlchar-remover
sianglim.slim
sleistner.vscode-fileutils
steoates.autoimport
TabNine.tabnine-vscode
techer.open-in-browser
Tyriar.sort-lines
vscodevim.vim
wingrunr21.vscode-ruby
wix.vscode-import-cost
wmaurer.change-case
xyz.local-history
yzhang.markdown-all-in-one
zengxingxin.sort-js-object-keys
ziyasal.vscode-open-in-github
